# coding=utf-8

CLASS_DEFAULT_TIME_TABLE = [
    {
        "index": 1,
        "end": "08:50:00",
        "start": "08:00:00"
    },
    {
        "index": 2,
        "end": "09:50:00",
        "start": "09:00:00"
    },
    {
        "index": 3,
        "end": "10:50:00",
        "start": "10:00:00"
    },
    {
        "index": 4,
        "end": "11:50:00",
        "start": "11:00:00"
    },
    {
        "index": 5,
        "end": "13:50:00",
        "start": "13:00:00"
    },
    {
        "index": 6,
        "end": "14:50:00",
        "start": "14:00:00"
    },
    {
        "index": 7,
        "end": "15:50:00",
        "start": "15:00:00"
    },
    {
        "index": 8,
        "end": "16:50:00",
        "start": "16:00:00"
    }
]

CLASS_DEFAULT_COURSE_TABLE = {
    "thursday": {
        "4": "点击编辑",
        "1": "点击编辑",
        "2": "点击编辑",
        "3": "点击编辑",
        "8": "点击编辑",
        "6": "点击编辑",
        "7": "点击编辑",
        "5": "点击编辑"
    },
    "tuesday": {
        "4": "点击编辑",
        "1": "点击编辑",
        "2": "点击编辑",
        "3": "点击编辑",
        "8": "点击编辑",
        "6": "点击编辑",
        "7": "点击编辑",
        "5": "点击编辑"
    },
    "wednesday": {
        "4": "点击编辑",
        "1": "点击编辑",
        "2": "点击编辑",
        "3": "点击编辑",
        "8": "点击编辑",
        "6": "点击编辑",
        "7": "点击编辑",
        "5": "点击编辑"
    },
    "friday": {
        "4": "点击编辑",
        "1": "点击编辑",
        "2": "点击编辑",
        "3": "点击编辑",
        "8": "点击编辑",
        "6": "点击编辑",
        "7": "点击编辑",
        "5": "点击编辑"
    },
    "monday": {
        "4": "点击编辑",
        "1": "点击编辑",
        "2": "点击编辑",
        "3": "点击编辑",
        "8": "点击编辑",
        "6": "点击编辑",
        "7": "点击编辑",
        "5": "点击编辑"
    }
}

TEACHER_ROLES = [
    '班主任', '语文老师', '数学老师', '英语老师', '物理老师', '化学老师', '生物老师', '体育老师', '音乐老师', '任课老师'
]
